Merge branch 'unstable' into Issue/190_LoggerGroupFilter
