--- a/README.md
+++ b/README.md
@@ -60,58 +60,49 @@ The parts above are represented as interfaces and thus allow creating decoupled 
 
 > Note: may vary depending on component implementations
 
-```
-             +--------------+
-             | Input folder |
-             ++------------++
-     DLL, EXE |            | XML
-              v            v
-+-------------+---+    +---+-------------+
-|     Members     |    |  Documentation  |
-+-------------+---+    +---+-------------+
-        IType |            | IDocElement
-              v            v
-       +------+------------+-----+
-+------+------+            +-----+-------+
-|   Elements  |  Composers |   Linkers   |
-+------+------+            +-----+-------+
-       +------------+------------+
-                    | IElement
-                    v
-              +-----+-------+
-              |  Printers   |
-              +-----+-------+
-                    | Documentaion file (.md, .html, ...)
-                    v
-             +------+--------+
-             | Output folder |
-             +---------------+
-
+```mermaid
+flowchart TB
+    inputFolder[Input Folder]
+    member[Member resolver]
+    documentation[Documentation resolver]
+    printer[Printer]
+    outputFolder[Output folder]
+    
+    inputFolder -- Dll, EXE --> member
+    inputFolder -- XML --> documentation
+    subgraph Composer
+        direction RL
+        elements[Markdown elements]
+        linker[Git Linker]
+    end
+    member -- IType --> Composer
+    documentation -- IDocElement --> Composer
+    Composer -- IElement --> printer
+    printer -- Documentation file --> outputFolder
 ```
 
 # Roadmap
 
